tap "armmbed/formulae"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "sambadevi/powerlevel9k"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Fish completion for brew-cask
brew "brew-cask-completion"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Core application library for C
brew "glib"
# GNU File, Shell, and Text utilities
brew "coreutils"
# HTTP/2 C Library
brew "nghttp2"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Emacs text editor
brew "emacs"
# Emacs dependency management
brew "cask"
# Cross-platform make
brew "cmake"
# Configurable talking characters in ASCII art
brew "cowsay"
# USB programmer
brew "dfu-util"
# OpenType text shaping engine
brew "harfbuzz"
# Secure Reliable Transport
brew "srt"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Distributed revision control system
brew "git", link: false
# Git extension for versioning large files
brew "git-lfs"
# Powerful, lightweight programming language
brew "lua"
# Utility for managing network connections
brew "netcat"
# Small build system for use with gyp or CMake
brew "ninja"
# Port scanning utility for large networks
brew "nmap"
# Python dependency management tool
brew "pipenv"
# Python package management tool
brew "poetry"
# Python version management
brew "pyenv"
# Tool for downloading RTMP streaming media
brew "rtmpdump"
# User interface to the TELNET protocol
brew "telnet"
# Programmatically correct mistyped console commands
brew "thefuck"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# UNIX shell (command interpreter)
brew "zsh"
brew "armmbed/formulae/arm-none-eabi-gcc"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Application launcher and productivity software
cask "alfred"
# Application uninstaller
cask "appcleaner"
# Electronics prototyping platform
cask "arduino"
# Tool to replace abbreviations while typing
cask "atext"
cask "autodesk-fusion360"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# App to build and share containerized applications and microservices
cask "docker"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Assign keys, and then decorate and label them
cask "elgato-stream-deck"
# App for note taking, organizing, task lists, and archiving
cask "evernote"
# VPN client for secure internet access and private browsing
cask "expressvpn"
cask "font-meslo-nerd-font"
cask "font-meslo-nerd-font-mono"
# Git client focusing on productivity
cask "gitkraken"
# Game development engine
cask "godot"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Note taking and to-do application with synchronization capabilities
cask "joplin"
# Electronics design automation suite
cask "kicad"
# Office suite
cask "microsoft-office"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Sandbox construction video game
cask "minecraft"
# Network utility for sending / receiving TCP, UDP, SSL
cask "packetsender"
# Desktop virtualization software
cask "parallels"
# Collaboration platform for API development
cask "postman"
cask "qlab"
# Control your tools with a few keystrokes
cask "raycast"
# Video chat, voice call and instant messaging application
cask "skype"
# Team communication and collaboration software
cask "slack"
# Video game digital distribution service
cask "steam"
# Open-source BitTorrent client
cask "transmission"
# Open-source code editor
cask "visual-studio-code"
# Network protocol analyzer
cask "wireshark"
