tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "sambadevi/powerlevel9k"
brew "bash-completion"
brew "brew-cask-completion"
brew "python@3.9"
brew "glib"
brew "carthage"
brew "emacs"
brew "cask"
brew "cowsay"
brew "exercism"
brew "harfbuzz"
brew "ffmpeg"
brew "git"
brew "git-lfs"
brew "lua"
brew "nmap", link: false
brew "node"
brew "pipenv"
brew "poetry"
brew "pyenv"
brew "python@3.8"
brew "rtmpdump"
brew "telnet"
brew "thefuck"
brew "yarn"
brew "youtube-dl"
brew "zsh"
brew "zsh-autosuggestions"
brew "sambadevi/powerlevel9k/powerlevel9k"
cask "1password"
cask "alfred"
cask "appcleaner"
cask "arduino"
cask "atext"
cask "autodesk-fusion360"
cask "balenaetcher"
cask "bartender"
cask "docker"
cask "dropbox"
cask "evernote"
cask "expressvpn"
cask "font-meslo-nerd-font"
cask "font-meslo-nerd-font-mono"
cask "gitkraken"
cask "godot"
cask "google-chrome"
cask "handbrake"
cask "iterm2"
cask "kicad"
cask "microsoft-office"
cask "minecraft"
cask "obsidian"
cask "packetsender"
cask "parallels"
cask "postman"
cask "qlab"
cask "raycast"
cask "skype"
cask "slack"
cask "steam"
cask "transmission"
cask "visual-studio-code"
cask "wireshark"
